import numpy as np
import cv2

# 定義一張黑色的影像 (400高 x 500寬, 3個色彩通道)
img = np.zeros([400, 500, 3], dtype='uint8')

# 畫一條藍色的直線（從(50,50)到(150,150)，線寬2，抗鋸齒）
cv2.line(img, (50, 50), (150, 150), (255, 0, 0), 2, cv2.LINE_AA,0)

# 畫一個綠色填滿的矩形（左上角到右下角）
cv2.rectangle(img, (200, 50), (300, 150), (0, 255, 0), -1)

# 畫一個紅色填滿的圓（中心為(400,100)，半徑為50）
cv2.circle(img, (400, 100), 50, (0, 0, 255), -1)

# 畫一個黃色的橢圓（中心在(100,300)，軸長(60,40)，旋轉135度）
cv2.ellipse(img, (100, 300), (60, 40), 135, 0, 360, (255, 255, 0), 1)

# 畫一個粉紅色的多邊形輪廓線
points = np.array([[200, 220], [220, 350], [280, 320], [300, 250]])
cv2.polylines(img, [points], True, (255, 0, 255))

# 畫一個青色的填滿多邊形
points = np.array([[400, 220], [350, 300], [420, 350], [450, 250]])
cv2.fillPoly(img, [points], (255, 255, 0))

# 顯示影像
cv2.imshow("Example", img)
cv2.waitKey(0)